package ch01;

public class annotation {

	public static void main(String[] args) {
		/**
		 *@author Hwang yu jeong 
		 * */
		
		/*JAVA 주석*/
		// 	주석 : 프로그램 코드 내에 삽입된 사용자의 메모를 의미
		//		 컴파일 과정에서 무시되므로 주석을 많이 작성한다고 바이트코드 파일이 커지는건 아님
		
		/*주석의 종류*/
		// 	1. 행주석 (//)
				// : //부터 행 끝까지 주석 처리
		// 	2. 범위 주석 (/*...*/)
				// : /*와 */사이에 있는 모든 내용 주석 처리
		// 	3. 도큐먼트 주석 (/**...*/)
				// : /**와 /*사이에 있는 모든 내용 주석 처리
				// : javadoc 명령어로 API 도큐먼트를 생성하는데 사용
									
		/*단축키*/
		// 	여러 줄 주석 처리: CTRL + /
		
		/*주의사항*/
		// 	문자열 내부에서 작성하면 안 됨 (문자열 내부에서는 문자열 데이터로 인식)
		
		/*사용 목적*/
		//	1. 개발을 하다 보면 코드에 대한 설명이 필요
		//	2. 협업할 때 다른 개발자와의 의사소통에도 필요
	}

}
