// 패키지 선언 - src/ch01 패키지에 있다는 뜻
package ch01;

// 클래스 영역 - 객체 지향 코드 구현 단위
public class BasicStructureOfJava {// 클래스 선언 - BasicStructureOfJava(클래스명)
									// 클래스명 :  숫자로 시작 x, 공백 포함 
									// {...} : 클래스 블록 : 클래스 정의 내용 작성
	
	// 메서드 영역 - 절차 지향 구현 단위
	public static void main(String[] args) {// main 메서드 영역

	
		/*메서드의 정의와 종류*/
//		0. 메서드(기능) : 특정 기능 수행. C언어의 함수 개념과 유사
//		1. main 메서드 : 최초 실행되는 함수
//		2. 라이브러리 메서드 : 개발 편의를 위해서 미리 만들어져 제공되는 함수
//		3. 사용자 정의 메서드 : 개발자가 정의한(만든) 함수
			
		/*main 메서드의 정의와 종류*/
//		0. main 메서드 : 프로그램의 진입점, 자바 가상머신(Java Virtual Machine)은 이 메서드를 찾아 실행
//		1. public : 어디에서든 접근 가능할 수 있도록 설정, main 메서드는 어디서든 접근 가능
//		2. static : main 메서드는 객체의 생성 없이 호출될 수 있도록 static으로 선언되어야 함
//		3. void : 반환값이 없음, main 메서드는 어떤 값을 반환하지 않도록 void 선언되어야 함
//		4. String[] args : main 메서드는 문자열 배열을 매개변수로 받음
//		5. 중괄호 {} : 내부에 프로그램 실행 시 실행될 코드 작성 -> 중괄호 안에서 프로그램 로직 구성			
	}

}
